cases/case3/constant/polyMesh/blockMeshDict
/*------------------------------*- C++ -*--------------------------------*\ 
| =========                 |                                             | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox       | 
|  \\    /   O peration     | Version:  2.4.0                             | 
|   \\  /    A nd           | Web:      www.openfoam.com                  | 
|    \\/     M anipulation  |                                             | 
\*-----------------------------------------------------------------------*/ 
FoamFile 
{ 
    version     2.0; 
    format      ascii; 
    class       dictionary; 
    object      blockMeshDict; 
} 
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

convertToMeters 1.0; 

vertices
(
    (     -50     -0.5        0)
    (      50     -0.5        0)
    (      50      0.5        0)
    (     -50      0.5        0)
    (     -50     -0.5        5)
    (      50     -0.5        5)
    (      50      0.5        5)
    (     -50      0.5        5)
    (     -50     -0.5      500)
    (      50     -0.5      500)
    (      50      0.5      500)
    (     -50      0.5      500)
);

edges
(
    spline 0 1 (
        ( -50.000000	-0.500000	0.000000 )
        ( -49.900000	-0.500000	0.000000 )
        ( -49.800000	-0.500000	0.000000 )
        ( -49.700000	-0.500000	0.000000 )
        ( -49.600000	-0.500000	0.000000 )
        ( -49.500000	-0.500000	0.000000 )
        ( -49.400000	-0.500000	0.000000 )
        ( -49.300000	-0.500000	0.000000 )
        ( -49.200000	-0.500000	0.000000 )
        ( -49.100000	-0.500000	0.000000 )
        ( -49.000000	-0.500000	0.000000 )
        ( -48.900000	-0.500000	0.000000 )
        ( -48.800000	-0.500000	0.000000 )
        ( -48.700000	-0.500000	0.000000 )
        ( -48.600000	-0.500000	0.000000 )
        ( -48.500000	-0.500000	0.000000 )
        ( -48.400000	-0.500000	0.000000 )
        ( -48.300000	-0.500000	0.000000 )
        ( -48.200000	-0.500000	0.000000 )
        ( -48.100000	-0.500000	0.000000 )
        ( -48.000000	-0.500000	0.000000 )
        ( -47.900000	-0.500000	0.000000 )
        ( -47.800000	-0.500000	0.000000 )
        ( -47.700000	-0.500000	0.000000 )
        ( -47.600000	-0.500000	0.000000 )
        ( -47.500000	-0.500000	0.000000 )
        ( -47.400000	-0.500000	0.000000 )
        ( -47.300000	-0.500000	0.000000 )
        ( -47.200000	-0.500000	0.000000 )
        ( -47.100000	-0.500000	0.000000 )
        ( -47.000000	-0.500000	0.000000 )
        ( -46.900000	-0.500000	0.000000 )
        ( -46.800000	-0.500000	0.000000 )
        ( -46.700000	-0.500000	0.000000 )
        ( -46.600000	-0.500000	0.000000 )
        ( -46.500000	-0.500000	0.000000 )
        ( -46.400000	-0.500000	0.000000 )
        ( -46.300000	-0.500000	0.000000 )
        ( -46.200000	-0.500000	0.000000 )
        ( -46.100000	-0.500000	0.000000 )
        ( -46.000000	-0.500000	0.000000 )
        ( -45.900000	-0.500000	0.000000 )
        ( -45.800000	-0.500000	0.000000 )
        ( -45.700000	-0.500000	0.000000 )
        ( -45.600000	-0.500000	0.000000 )
        ( -45.500000	-0.500000	0.000000 )
        ( -45.400000	-0.500000	0.000000 )
        ( -45.300000	-0.500000	0.000000 )
        ( -45.200000	-0.500000	0.000000 )
        ( -45.100000	-0.500000	0.000000 )
        ( -45.000000	-0.500000	0.000000 )
        ( -44.900000	-0.500000	0.000000 )
        ( -44.800000	-0.500000	0.000000 )
        ( -44.700000	-0.500000	0.000000 )
        ( -44.600000	-0.500000	0.000000 )
        ( -44.500000	-0.500000	0.000000 )
        ( -44.400000	-0.500000	0.000000 )
        ( -44.300000	-0.500000	0.000000 )
        ( -44.200000	-0.500000	0.000000 )
        ( -44.100000	-0.500000	0.000000 )
        ( -44.000000	-0.500000	0.000000 )
        ( -43.900000	-0.500000	0.000000 )
        ( -43.800000	-0.500000	0.000000 )
        ( -43.700000	-0.500000	0.000000 )
        ( -43.600000	-0.500000	0.000000 )
        ( -43.500000	-0.500000	0.000000 )
        ( -43.400000	-0.500000	0.000000 )
        ( -43.300000	-0.500000	0.000000 )
        ( -43.200000	-0.500000	0.000000 )
        ( -43.100000	-0.500000	0.000000 )
        ( -43.000000	-0.500000	0.000000 )
        ( -42.900000	-0.500000	0.000000 )
        ( -42.800000	-0.500000	0.000000 )
        ( -42.700000	-0.500000	0.000000 )
        ( -42.600000	-0.500000	0.000000 )
        ( -42.500000	-0.500000	0.000000 )
        ( -42.400000	-0.500000	0.000000 )
        ( -42.300000	-0.500000	0.000000 )
        ( -42.200000	-0.500000	0.000000 )
        ( -42.100000	-0.500000	0.000000 )
        ( -42.000000	-0.500000	0.000000 )
        ( -41.900000	-0.500000	0.000000 )
        ( -41.800000	-0.500000	0.000000 )
        ( -41.700000	-0.500000	0.000000 )
        ( -41.600000	-0.500000	0.000000 )
        ( -41.500000	-0.500000	0.000000 )
        ( -41.400000	-0.500000	0.000000 )
        ( -41.300000	-0.500000	0.000000 )
        ( -41.200000	-0.500000	0.000000 )
        ( -41.100000	-0.500000	0.000000 )
        ( -41.000000	-0.500000	0.000000 )
        ( -40.900000	-0.500000	0.000000 )
        ( -40.800000	-0.500000	0.000000 )
        ( -40.700000	-0.500000	0.000000 )
        ( -40.600000	-0.500000	0.000000 )
        ( -40.500000	-0.500000	0.000000 )
        ( -40.400000	-0.500000	0.000000 )
        ( -40.300000	-0.500000	0.000000 )
        ( -40.200000	-0.500000	0.000000 )
        ( -40.100000	-0.500000	0.000000 )
...
    )
    spline 3 2 (
        ( -50.000000	0.500000	0.000000 )
        ( -49.900000	0.500000	0.000000 )
        ( -49.800000	0.500000	0.000000 )
        ( -49.700000	0.500000	0.000000 )
        ( -49.600000	0.500000	0.000000 )
        ( -49.500000	0.500000	0.000000 )
        ( -49.400000	0.500000	0.000000 )
        ( -49.300000	0.500000	0.000000 )
        ( -49.200000	0.500000	0.000000 )
        ( -49.100000	0.500000	0.000000 )
        ( -49.000000	0.500000	0.000000 )
        ( -48.900000	0.500000	0.000000 )
        ( -48.800000	0.500000	0.000000 )
        ( -48.700000	0.500000	0.000000 )
        ( -48.600000	0.500000	0.000000 )
        ( -48.500000	0.500000	0.000000 )
        ( -48.400000	0.500000	0.000000 )
        ( -48.300000	0.500000	0.000000 )
        ( -48.200000	0.500000	0.000000 )
        ( -48.100000	0.500000	0.000000 )
        ( -48.000000	0.500000	0.000000 )
        ( -47.900000	0.500000	0.000000 )
        ( -47.800000	0.500000	0.000000 )
        ( -47.700000	0.500000	0.000000 )
        ( -47.600000	0.500000	0.000000 )
        ( -47.500000	0.500000	0.000000 )
        ( -47.400000	0.500000	0.000000 )
        ( -47.300000	0.500000	0.000000 )
        ( -47.200000	0.500000	0.000000 )
        ( -47.100000	0.500000	0.000000 )
        ( -47.000000	0.500000	0.000000 )
        ( -46.900000	0.500000	0.000000 )
        ( -46.800000	0.500000	0.000000 )
        ( -46.700000	0.500000	0.000000 )
        ( -46.600000	0.500000	0.000000 )
        ( -46.500000	0.500000	0.000000 )
        ( -46.400000	0.500000	0.000000 )
        ( -46.300000	0.500000	0.000000 )
        ( -46.200000	0.500000	0.000000 )
        ( -46.100000	0.500000	0.000000 )
        ( -46.000000	0.500000	0.000000 )
        ( -45.900000	0.500000	0.000000 )
        ( -45.800000	0.500000	0.000000 )
        ( -45.700000	0.500000	0.000000 )
        ( -45.600000	0.500000	0.000000 )
        ( -45.500000	0.500000	0.000000 )
        ( -45.400000	0.500000	0.000000 )
        ( -45.300000	0.500000	0.000000 )
        ( -45.200000	0.500000	0.000000 )
        ( -45.100000	0.500000	0.000000 )
        ( -45.000000	0.500000	0.000000 )
        ( -44.900000	0.500000	0.000000 )
        ( -44.800000	0.500000	0.000000 )
        ( -44.700000	0.500000	0.000000 )
        ( -44.600000	0.500000	0.000000 )
        ( -44.500000	0.500000	0.000000 )
        ( -44.400000	0.500000	0.000000 )
        ( -44.300000	0.500000	0.000000 )
        ( -44.200000	0.500000	0.000000 )
        ( -44.100000	0.500000	0.000000 )
        ( -44.000000	0.500000	0.000000 )
        ( -43.900000	0.500000	0.000000 )
        ( -43.800000	0.500000	0.000000 )
        ( -43.700000	0.500000	0.000000 )
        ( -43.600000	0.500000	0.000000 )
        ( -43.500000	0.500000	0.000000 )
        ( -43.400000	0.500000	0.000000 )
        ( -43.300000	0.500000	0.000000 )
        ( -43.200000	0.500000	0.000000 )
        ( -43.100000	0.500000	0.000000 )
        ( -43.000000	0.500000	0.000000 )
        ( -42.900000	0.500000	0.000000 )
        ( -42.800000	0.500000	0.000000 )
        ( -42.700000	0.500000	0.000000 )
        ( -42.600000	0.500000	0.000000 )
        ( -42.500000	0.500000	0.000000 )
        ( -42.400000	0.500000	0.000000 )
        ( -42.300000	0.500000	0.000000 )
        ( -42.200000	0.500000	0.000000 )
        ( -42.100000	0.500000	0.000000 )
        ( -42.000000	0.500000	0.000000 )
        ( -41.900000	0.500000	0.000000 )
        ( -41.800000	0.500000	0.000000 )
        ( -41.700000	0.500000	0.000000 )
        ( -41.600000	0.500000	0.000000 )
        ( -41.500000	0.500000	0.000000 )
        ( -41.400000	0.500000	0.000000 )
        ( -41.300000	0.500000	0.000000 )
        ( -41.200000	0.500000	0.000000 )
        ( -41.100000	0.500000	0.000000 )
        ( -41.000000	0.500000	0.000000 )
        ( -40.900000	0.500000	0.000000 )
        ( -40.800000	0.500000	0.000000 )
        ( -40.700000	0.500000	0.000000 )
        ( -40.600000	0.500000	0.000000 )
        ( -40.500000	0.500000	0.000000 )
        ( -40.400000	0.500000	0.000000 )
        ( -40.300000	0.500000	0.000000 )
        ( -40.200000	0.500000	0.000000 )
        ( -40.100000	0.500000	0.000000 )
...
);

blocks
(
    hex (0  1  2  3  4  5  6  7) (1600 16 11)
      simpleGrading (
        ((0.15 0.15 1) (0.2 0.20125 1) (0.15 0.14875 1) (0.15 0.14875 1) (0.2 0.20125 1) (0.15 0.15 1))
        ((0.5 0.5 2) (0.5 0.5 0.5))
        1
      )
    hex (4  5  6  7 8 9 10 11) (1600 16 256)
      simpleGrading (
        ((0.15 0.15 1) (0.2 0.20125 1) (0.15 0.14875 1) (0.15 0.14875 1) (0.2 0.20125 1) (0.15 0.15 1))
        ((0.5 0.5 2) (0.5 0.5 0.5))
        10
      )
);

boundary
(
    outlet
    {
      type patch;
      faces
      (
        (8  9  10  11)
      );
    }

    inlet
    {
      type patch;
      faces
      (
        (0   1   2   3)
      );
    }

    walls
    {
      type wall;
      faces
      (
        ( 0   1   5   4)
        ( 4   5   9   8)
        ( 2   6   7   3)
        ( 6  10  11   7)
      );
    }

    periodicx1
    {
      type cyclic;
      neighbourPatch periodicx2;
      faces
      (
        ( 0   3   7   4)
        ( 4   7  11   8)
      );
    }

    periodicx2
    {
      type cyclic;
      neighbourPatch periodicx1;
      faces
      (
        ( 1   2   6   5)
        ( 5   6  10   9)
      );
    }

);

mergePatchPairs
(
);

// ********************************************************************* //
